someone42/hardware-bitcoin-wallet/pic32/hwrng.c
/** \file hwrng.c
  *
  * \brief Collects and tests HWRNG samples.
  *
  * The code in this file provides an implementation of
  * hardwareRandom32Bytes() by offering hardware random number generator
  * (HWRNG) samples from the ADC (see adc.c). However, the majority of code in
  * this file is dedicated to statistical testing of those samples.
  *
  * Why bother going to all the trouble to test the HWRNG? Many cryptographic
  * operations (eg. signing, wallet seed generation) depend on the quality of
  * their entropy source. Hardware failure could compromise a HWRNG's quality.
  * The tests in this file aim to test for hardware failure. The tests will
  * not detect every failure and will not detect intentional tampering
  * (although they make such tampering more difficult). The assumption made
  * here is that the HWRNG is a white Gaussian noise source.
  * The statistical limits for each test are defined in hwrng_limits.h.
  *
  * This file is licensed as described by the file LICENCE.
  */

#include <stdint.h>
#include <stdbool.h>
#include <p32xxxx.h>
#include "../fix16.h"
#include "../fft.h"
#include "../statistics.h"
#include "hwrng_limits.h"
#include "adc.h"
#include "pic32_system.h"

#ifdef TEST_STATISTICS
#include "ssd1306.h"
#include "../endian.h"
#include "../hwinterface.h"

static void reportStatistics(uint32_t tests_failed);
static void reportFftResults(ComplexFixed *fft_buffer);

// These are copies of some variables in histogramTestsFailed() and
// fftTestsFailed() which are reported by reportStatistics().
static fix16_t most_recent_mean;
static fix16_t most_recent_variance;
static fix16_t most_recent_kappa3;
static fix16_t most_recent_kappa4;
static int most_recent_max_bin;
static int most_recent_bandwidth;
static fix16_t most_recent_max_autocorrelation;
static fix16_t most_recent_entropy_estimate;

/** Set to non-zero to send statistical properties to stream. 1 = moment-based
  * statistical properties, 2 = power spectral density estimate, 3 = bandwidth
  * estimate, 4 = autocorrelation results, 5 = maximum autocorrelation value
  * and entropy estimate. */
static int report_to_stream;
#endif // #ifdef TEST_STATISTICS

/** Number of ADC samples per HWRNG sample. The signal is oversampled and then
  * filtered in the digital domain to improve the robustness of the HWRNG to
  * high-frequency intereference. */
#define OVERSAMPLE_RATIO				2
/** Size of sample buffer after filtering and decimation. */
#define DECIMATED_SAMPLE_BUFFER_SIZE	(ADC_SAMPLE_BUFFER_SIZE / OVERSAMPLE_RATIO)
/** Approximately half the order (i.e. "number of points" or "size") of the
  * FIR filter. This influences #FILTER_ORDER. This must match the parameter
  * listed in calculate_fir_coefficients.m. */
#define FILTER_HALF_ORDER				8
/** The order (i.e. "number of points" or "size") of the FIR filter. Bigger
  * means higher quality and more computation time. To adjust this,
  * see #FILTER_HALF_ORDER. */
#define FILTER_ORDER					(2 * FILTER_HALF_ORDER + 1)
/** FIR filter coefficients, calculated using calculate_fir_coefficients.m
  * and expressed in Q16.16 fixed-point representation. */
static const int32_t fir_lowpass_coefficients[FILTER_ORDER] = {
-123, 202, 711, 0, -2681, -2929, 5309, 19161,
26236,
19161, 5309, -2929, -2681, 0, 711, 202, -123};

/** Array of samples which have passed statistical tests. #SAMPLE_COUNT samples
  * need to be stored because hardwareRandom32Bytes() cannot start returning
  * samples from this array until all statistical tests have passed. */
static volatile uint16_t samples[SAMPLE_COUNT];
/** Number of samples in #samples that hardwareRandom32Bytes() has
  * used up. */
static uint32_t samples_consumed;

/** Obtains an estimate of the bandwidth of the HWRNG, based on the power
  * spectrum density estimate (see #psd_accumulator).
  * This is platform-dependent because of its reliance on
  * the #PSD_BANDWIDTH_THRESHOLD and #PSD_THRESHOLD_REPETITIONS constants.
  * \param out_max_bin Pointer to variable which will receive the bin number
  *                    of the peak value in the power spectrum.
  * \return The bandwidth, in number of FFT bins.
  */
static int estimateBandwidth(int *out_max_bin)
{
	int i;
	fix16_t threshold;
	int max_bin;
	int left_bin;
	int right_bin;
	int below_counter;

	threshold = fix16_zero;
	max_bin = 0;
	for (i = 0; i < (FFT_SIZE + 1); i++)
	{
		if (psd_accumulator[i] > threshold)
		{
			threshold = psd_accumulator[i];
			max_bin = i;
		}
	}
	threshold = fix16_mul(threshold, F16(PSD_BANDWIDTH_THRESHOLD));

	// Search for left edge.
	below_counter = 0;
	left_bin = 0;
	for (i = max_bin; i >= 0; i--)
	{
		if (psd_accumulator[i] < threshold)
		{
			below_counter++;
		}
		else
		{
			below_counter = 0;
		}
		if (below_counter >= PSD_THRESHOLD_REPETITIONS)
		{
			left_bin = i + PSD_THRESHOLD_REPETITIONS;
			break;
		}
	}
	// Search for right edge.
	below_counter = 0;
	right_bin = FFT_SIZE;
	for (i = max_bin; i < (FFT_SIZE + 1); i++)
	{
		if (psd_accumulator[i] < threshold)
		{
			below_counter++;
		}
		else
		{
			below_counter = 0;
		}
		if (below_counter >= PSD_THRESHOLD_REPETITIONS)
		{
			right_bin = i - PSD_THRESHOLD_REPETITIONS;
			break;
		}
	}
	*out_max_bin = max_bin;
	return right_bin - left_bin;
}

/** Find the magnitude of the largest autocorrelation amplitude.
  * Theoretically, for an infinitely large sample and a perfect noise source,
  * the autocorrelation amplitude should be 0 everywhere (except for lag = 0).
  * Thus the maximum magnitude quantifies how non-ideal the HWRNG is.
  * This is platform-dependent because of its reliance on
  * the #AUTOCORR_START_LAG constant.
  * \param fft_buffer The correlogram, as calculated by
  *                   calculateAutoCorrelation(). This should have at
  *                   least #FFT_SIZE + 1 entries.
  */
static fix16_t findMaximumAutoCorrelation(ComplexFixed *fft_buffer)
{
	fix16_t max;
	fix16_t sample;
	uint32_t i;

	max = fix16_zero;
	for (i = AUTOCORR_START_LAG; i < (FFT_SIZE + 1); i++)
	{
		sample = fft_buffer[i].real;
		if (sample < fix16_zero)
		{
			sample = -sample;
		}
		if (sample > max)
		{
			max = sample;
		}
	}
	return max;
}

