someone42/hardware-bitcoin-wallet/pic32/hwrng.c
/** Run histogram-based statistical tests on HWRNG signal and report any
  * failures.
  * This only should be called once the histogram is full.
  * \param variance After it is calculated, the variance will be written here
  *                 (it's needed so that fftTestsFailed() can do some
  *                 normalisation).
  * \return 0 if all tests passed, non-zero if any tests failed.
  */
static NOINLINE uint32_t histogramTestsFailed(fix16_t *variance)
{
	uint32_t tests_failed;
	bool moment_error_occurred;
	bool entropy_error_occurred;
	fix16_t mean;
	fix16_t kappa3; // non-standardised skewness
	fix16_t kappa4; // non-standardised kurtosis
	fix16_t variance_squared;
	fix16_t three_times_variance_squared;
	fix16_t variance_cubed;
	fix16_t kappa3_squared;
	fix16_t term1;
	fix16_t entropy_estimate;

	fix16_error_occurred = false;
	mean = calculateCentralMoment(fix16_zero, 1);
	*variance = calculateCentralMoment(mean, 2);
	kappa3 = calculateCentralMoment(mean, 3);
	kappa4 = calculateCentralMoment(mean, 4);
	moment_error_occurred = fix16_error_occurred;
	fix16_error_occurred = false;
	entropy_estimate = estimateEntropy();
	entropy_error_occurred = fix16_error_occurred;

#ifdef TEST_STATISTICS
	most_recent_mean = mean;
	most_recent_variance = *variance;
	most_recent_kappa3 = kappa3;
	most_recent_kappa4 = kappa4;
	most_recent_entropy_estimate = entropy_estimate;
#endif // #ifdef TEST_STATISTICS

	tests_failed = 0;
	// STATTEST_MIN_MEAN and STATTEST_MAX_MEAN are in ADC output numbers.
	// To be comparable to mean, they need to be scaled and offset, just
	// as samples are in updateIteratorCache().
	if (mean <= F16((STATTEST_MIN_MEAN - (HISTOGRAM_NUM_BINS / 2)) / SAMPLE_SCALE_DOWN))
	{
		tests_failed |= 1; // mean below minimum
	}
	if (mean >= F16((STATTEST_MAX_MEAN - (HISTOGRAM_NUM_BINS / 2)) / SAMPLE_SCALE_DOWN)) 
	{
		tests_failed |= 1; // mean above maximum
	}
	if (*variance <= F16((STATTEST_MIN_VARIANCE / SAMPLE_SCALE_DOWN) / SAMPLE_SCALE_DOWN))
	{
		tests_failed |= 2; // variance below minimum
	}
	if (*variance >= F16((STATTEST_MAX_VARIANCE / SAMPLE_SCALE_DOWN) / SAMPLE_SCALE_DOWN))
	{
		tests_failed |= 2; // variance below minimum
	}
	// kappa3 is supposed to be standardised by dividing by
	// variance ^ (3/2), but this would involve one division and one square
	// root. But since skewness = kappa3 / variance ^ (3/2), this implies
	// that kappa3 ^ 2 = variance ^ 3 * skewness ^ 2.
	variance_squared = fix16_mul(*variance, *variance);
	variance_cubed = fix16_mul(variance_squared, *variance);
	kappa3_squared = fix16_mul(kappa3, kappa3);
	// Thanks to the squaring of kappa3, only one test is needed.
	if (kappa3_squared >= fix16_mul(variance_cubed, F16(STATTEST_MAX_SKEWNESS * STATTEST_MAX_SKEWNESS)))
	{
		tests_failed |= 4; // skewness out of bounds
	}
	// kappa4 is supposed to be standardised by dividing by variance ^ 2, but
	// this would involve division. But since
	// kurtosis = kappa4 / variance ^ 2 - 3, this implies that
	// kappa_4 = kurtosis * variance ^ 2 + 3 * variance ^ 2.
	three_times_variance_squared = fix16_mul(fix16_from_int(3), variance_squared);
	term1 = fix16_mul(F16(STATTEST_MIN_KURTOSIS), variance_squared);
	if (kappa4 <= fix16_add(term1, three_times_variance_squared))
	{
		tests_failed |= 8; // kurtosis below minimum
	}
	term1 = fix16_mul(F16(STATTEST_MAX_KURTOSIS), variance_squared);
	if (kappa4 >= fix16_add(term1, three_times_variance_squared))
	{
		tests_failed |= 8; // kurtosis above maximum
	}
	if (moment_error_occurred || histogram_overflow_occurred)
	{
		tests_failed |= 15; // arithmetic error (probably overflow)
	}
	if (entropy_estimate < F16(STATTEST_MIN_ENTROPY))
	{
		tests_failed |= 128; // entropy per sample below minimum
	}
	if (entropy_error_occurred)
	{
		tests_failed |= 128; // arithmetic error (probably overflow)
	}

	return tests_failed;
}

/** Run FFT-based statistical tests on HWRNG signal and report any failures.
  * This only should be called once the power spectral density accumulator
  * (see #psd_accumulator) has accumulated enough samples.
  * \param variance The variance, as calculated by histogramTestsFailed().
  * \return 0 if all tests passed, non-zero if any tests failed.
  */
static NOINLINE uint32_t fftTestsFailed(fix16_t variance)
{
	uint32_t tests_failed;
	bool autocorrelation_error_occurred;
	int bandwidth; // as FFT bin number
	int max_bin; // as FFT bin number
	fix16_t max_autocorrelation;
	ComplexFixed fft_buffer[FFT_SIZE + 1];

	bandwidth = estimateBandwidth(&max_bin);
	fix16_error_occurred = false;
	autocorrelation_error_occurred = calculateAutoCorrelation(fft_buffer);
	max_autocorrelation = findMaximumAutoCorrelation(fft_buffer);

#ifdef TEST_STATISTICS
	if (report_to_stream == 4)
	{
		// Report autocorrelation results.
		reportFftResults(fft_buffer);
	}
	most_recent_max_bin = max_bin;
	most_recent_bandwidth = bandwidth;
	most_recent_max_autocorrelation = max_autocorrelation;
#endif // #ifdef TEST_STATISTICS

	tests_failed = 0;
	if (fix16_from_int(max_bin) < F16(PSD_MIN_PEAK * 2.0 * FFT_SIZE))
	{
		tests_failed |= 16; // peak in power spectrum is below minimum frequency
	}
	if (fix16_from_int(max_bin) > F16(PSD_MAX_PEAK * 2.0 * FFT_SIZE))
	{
		tests_failed |= 16; // peak in power spectrum is above maximum frequency
	}
	if (fix16_from_int(bandwidth) < F16(PSD_MIN_BANDWIDTH * 2.0 * FFT_SIZE))
	{
		tests_failed |= 32; // bandwidth of HWRNG below minimum
	}
	if (psd_accumulator_error_occurred)
	{
		tests_failed |= 48; // arithmetic error (probably overflow)
	}
	if (max_autocorrelation > fix16_mul(variance, F16(AUTOCORR_THRESHOLD)))
	{
		tests_failed |= 64; // maximum autocorrelation amplitude above maximum
	}
	if (autocorrelation_error_occurred)
	{
		tests_failed |= 64; // arithmetic error (probably overflow)
	}
	return tests_failed;
}

/** Apply FIR filter to samples.
  * \param samples Array of input samples. It must
  *                contain #ADC_SAMPLE_BUFFER_SIZE samples.
  * \param base_index Index into samples array to begin applying filter.
  * \param coefficients Array of FIR filter coefficients, in Q16.16
  *                     fixed-point representation.
  * \param order Order (number of coefficients) of the filter.
  * \return The output sample.
  * \warning All filter coefficients should have a magnitude of less than one.
  */
static int32_t firFilter(const volatile uint16_t *samples, const unsigned int base_index, const int32_t *coefficients, const unsigned int order)
{
	int32_t sum; // Q16.16 fixed-point representation
	unsigned int i;
	unsigned int index;

	// Convolute samples with coefficients.
	sum = 0;
	for (i = 0; i < order; i++)
	{
		// The "& (ADC_SAMPLE_BUFFER_SIZE - 1)" makes this a circular
		// convolution. Circular convolution treats every sample in the
		// ADC buffer fairly.
		index = (base_index + i) & (ADC_SAMPLE_BUFFER_SIZE - 1);
		sum += ((int32_t)samples[index]) * coefficients[i];
	}
	return (sum >> 16) + ((sum >> 15) & 1); // round result
}

/** Gather #SAMPLE_COUNT ADC samples into #samples and run statistical tests
  * on the sample array.
  * \return false on success, true if any statistical test failed.
  */
static bool fillAndTestSamplesArray(void)
{
	unsigned int i;
	unsigned int j;
	unsigned int base_index;
	int32_t filtered_sample;
	uint32_t tests_failed;
	fix16_t variance;

	clearHistogram();
	clearPowerSpectralDensity();
	samples_consumed = 0;

