someone42/hardware-bitcoin-wallet/pic32/hwrng.c
	// Fill samples array.
	// The following loop assumes that #SAMPLE_COUNT is a multiple
	// of #DECIMATED_SAMPLE_BUFFER_SIZE.
#if ((SAMPLE_COUNT % DECIMATED_SAMPLE_BUFFER_SIZE) != 0)
#error "SAMPLE_COUNT not a multiple of DECIMATED_SAMPLE_BUFFER_SIZE"
#endif // #if ((SAMPLE_COUNT % DECIMATED_SAMPLE_BUFFER_SIZE) != 0)
	for (i = 0; i < SAMPLE_COUNT; i += DECIMATED_SAMPLE_BUFFER_SIZE)
	{
		suppressIdleMode(true); // start suppressing CPU idle mode
		beginFillingADCBuffer();
		while (!isADCBufferFull())
		{
			// do nothing
		}
		suppressIdleMode(false); // stop suppressing CPU idle mode
		// Filter ADC samples, placing result into samples array.
		for (j = 0; j < DECIMATED_SAMPLE_BUFFER_SIZE; j++)
		{
			// The "- FILTER_HALF_ORDER" is there to account for the
			// delay of the low-pass filter.
			base_index = ((j * OVERSAMPLE_RATIO) - FILTER_HALF_ORDER) & (ADC_SAMPLE_BUFFER_SIZE - 1);
			filtered_sample = firFilter(adc_sample_buffer, base_index, fir_lowpass_coefficients, FILTER_ORDER);
			samples[i + j] = filtered_sample;
		}
	}

	// Run statistical tests on samples array.
	for (i = 0; i < SAMPLE_COUNT; i++)
	{
		incrementHistogram(samples[i]);
	}
	// The following loop assumes that #SAMPLE_COUNT is a multiple
	// of #FFT_SIZE * 2.
#if ((SAMPLE_COUNT % (FFT_SIZE * 2)) != 0)
#error "SAMPLE_COUNT not a multiple of FFT_SIZE * 2"
#endif // #if ((SAMPLE_COUNT % (FFT_SIZE * 2)) != 0)
	for (i = 0; i < SAMPLE_COUNT; i += (FFT_SIZE * 2))
	{
		accumulatePowerSpectralDensity(&(samples[i]));
	}
	tests_failed = histogramTestsFailed(&variance);
	tests_failed |= fftTestsFailed(variance);
#ifdef TEST_STATISTICS
	reportStatistics(tests_failed);
#endif // #ifdef TEST_STATISTICS
	if (tests_failed != 0)
	{
#ifdef IGNORE_HWRNG_FAILURE
		PORTDSET = 0x10; // turn on red LED
		delayCycles(CYCLES_PER_MILLISECOND * 100);
		PORTDCLR = 0x10; // turn off red LED
#else
		return true; // statistical tests indicate HWRNG failure
#endif // #ifdef IGNORE_HWRNG_FAILURE
	}
	return false;
}

/** Fill buffer with 32 random bytes from a hardware random number generator.
  * \param buffer The buffer to fill. This should have enough space for 32
  *               bytes.
  * \return An estimate of the total number of bits (not bytes) of entropy in
  *         the buffer on success, or a negative number if the hardware random
  *         number generator failed in any way. This may also return 0 to tell
  *         the caller that more samples are needed in order to do any
  *         meaningful statistical testing. If this returns 0, the caller
  *         should continue to call this until it returns a non-zero value.
  */
int hardwareRandom32Bytes(uint8_t *buffer)
{
	unsigned int i;
	uint32_t sample;
	bool tests_failed;

	tests_failed = false;
	if ((samples_consumed == 0) || (samples_consumed >= SAMPLE_COUNT))
	{
		if (fillAndTestSamplesArray())
		{
#ifdef TEST_STATISTICS
			tests_failed = true;
#else
			return -1; // statistical tests indicate HWRNG failure
#endif // #ifdef TEST_STATISTICS
		}
	}

	// Fill entropy buffer with ADC sample data.
	// The following loop assumes that #DECIMATED_SAMPLE_BUFFER_SIZE is a
	// multiple of 16.
#if ((DECIMATED_SAMPLE_BUFFER_SIZE % 16) != 0)
#error "DECIMATED_SAMPLE_BUFFER_SIZE not a multiple of 16"
#endif // #if ((DECIMATED_SAMPLE_BUFFER_SIZE % 16) != 0)
	for (i = 0; i < 16; i++)
	{
		sample = samples[samples_consumed];
		buffer[i * 2] = (uint8_t)sample;
		buffer[i * 2 + 1] = (uint8_t)(sample >> 8);
		samples_consumed++;
	}
	if (tests_failed)
	{
		return -1; // statistical tests indicate HWRNG failure
	}
	else
	{
		return (int)(16.0 * ENTROPY_BITS_PER_SAMPLE);
	}
}

#ifdef TEST_STATISTICS

/** Quick and dirty conversion of fix16 to string.
  * \param buffer Character buffer where null-terminated will be written to.
  *               Must have space for 16 characters.
  * \param in Number to convert to string.
  */
static void sprintFix16(char *buffer, fix16_t in)
{
	bool suppress_leading_zeroes;
	int i;
	int index;
	uint32_t int_part;
	uint32_t digit;
	char temp[5];

	// Check sign.
	index = 0;
	if (in < fix16_zero)
	{
		in = -in;
		buffer[index++] = '-';
	}

	// Convert integer part.
	int_part = ((uint32_t)in) >> 16;
	for (i = 0; i < 5; i++)
	{
		digit = int_part % 10;
		int_part = int_part / 10;
		temp[i] = (char)(digit + '0');
	}
	suppress_leading_zeroes = true;
	for (i = 0; i < 5; i++)
	{
		if (!suppress_leading_zeroes || (temp[4 - i] != '0'))
		{
			buffer[index++] = temp[4 - i];
			suppress_leading_zeroes = false;
		}
	}
	// If integer part is 0, include one leading zero.
	if (suppress_leading_zeroes)
	{
		buffer[index++] = '0';
	}
	buffer[index++] = '.';

	// Convert fractional part.
	in = (fix16_t)(((uint32_t)in) & 0xffff);
	for (i = 0; i < 7; i++)
	{
		in *= 10;
		digit = ((uint32_t)in) >> 16;
		buffer[index++] = (char)(digit + '0');
		in = (fix16_t)(((uint32_t)in) & 0xffff);
	}

	buffer[index++] = '\0';
}

/** Send null-terminated string to stream.
  * \param buffer The string to send.
  */
static void sendString(const char *buffer)
{
	for(; *buffer != '\0'; buffer++)
	{
		streamPutOneByte(*buffer);
	}
}

/** Write contents of FFT buffer to stream so that the host may capture FFT
  * results into a comma-seperated variable file.
  * \param fft_buffer The FFT buffer whose contents will be dumped onto the
  *                   stream. This must have #FFT_SIZE + 1 entries.
  */
static void reportFftResults(ComplexFixed *fft_buffer)
{
	uint32_t i;
	char buffer[20];

	for (i = 0; i < (FFT_SIZE + 1); i++)
	{
		sprintFix16(buffer, fix16_from_int(i));
		sendString(buffer);
		sendString(", ");
		sprintFix16(buffer, fft_buffer[i].real);
		sendString(buffer);
		sendString(", ");
		sprintFix16(buffer, fft_buffer[i].imag);
		sendString(buffer);
		sendString("\r\n");
	}
}

/** Write statistical properties to screen so that they may be inspected in
  * real-time. Because there are too many properties to fit on-screen,
  * there are various testing modes which will write different properties.
  * If reporting to stream is enabled, the properties are also written to the
  * stream so that the host may capture them into a comma-seperated variable
  * file.
  * \param tests_failed Indicates which tests failed. 0 means that no tests
  *                     failed. Non-zero means that at least one test failed.
  *                     The bit position of each bit that is set expresses
  *                     which test failed.
  */
static void reportStatistics(uint32_t tests_failed)
{
	int i;
	char buffer[20];

