someone42/hardware-bitcoin-wallet/pic32/hwrng.c
	displayOn();
	clearDisplay();

	if ((report_to_stream == 2) || (report_to_stream == 1) || (report_to_stream == 0))
	{
		// Report moment-based properties.
		sprintFix16(buffer, most_recent_mean);
		writeStringToDisplay(buffer);
		if (report_to_stream == 1)
		{
			sendString(buffer);
			sendString(", ");
		}
		nextLine();
		sprintFix16(buffer, most_recent_variance);
		writeStringToDisplay(buffer);
		if (report_to_stream == 1)
		{
			sendString(buffer);
			sendString(", ");
		}
		nextLine();
		sprintFix16(buffer, most_recent_kappa3);
		writeStringToDisplay(buffer);
		if (report_to_stream == 1)
		{
			sendString(buffer);
			sendString(", ");
		}
		nextLine();
		sprintFix16(buffer, most_recent_kappa4);
		writeStringToDisplay(buffer);
		if (report_to_stream == 1)
		{
			sendString(buffer);
		}
	} // end if ((report_to_stream == 2) || (report_to_stream == 1) || (report_to_stream == 0))

	if (report_to_stream == 2)
	{
		// Report power spectral density estimate.
		for (i = 0; i < (FFT_SIZE + 1); i++)
		{
			sprintFix16(buffer, fix16_from_int(i));
			sendString(buffer);
			sendString(", ");
			sprintFix16(buffer, psd_accumulator[i]);
			sendString(buffer);
			sendString("\r\n");
		}
	}

	if (report_to_stream == 3)
	{
		// Report peak frequency and signal bandwidth estimate.
		sprintFix16(buffer, fix16_from_int(most_recent_max_bin));
		writeStringToDisplay(buffer);
		sendString(buffer);
		sendString(", ");
		nextLine();
		sprintFix16(buffer, fix16_from_int(most_recent_bandwidth));
		writeStringToDisplay(buffer);
		sendString(buffer);
		nextLine();
	}

	if ((report_to_stream == 4) || (report_to_stream == 5))
	{
		// Report maximum autocorrelation value and entropy estimate.
		sprintFix16(buffer, most_recent_variance);
		writeStringToDisplay(buffer);
		if (report_to_stream == 5)
		{
			sendString(buffer);
			sendString(", ");
		}
		nextLine();
		sprintFix16(buffer, most_recent_max_autocorrelation);
		writeStringToDisplay(buffer);
		if (report_to_stream == 5)
		{
			sendString(buffer);
			sendString(", ");
		}
		nextLine();
		sprintFix16(buffer, most_recent_entropy_estimate);
		writeStringToDisplay(buffer);
		if (report_to_stream == 5)
		{
			sendString(buffer);
		}
		nextLine();
	}

	writeStringToDisplay(" ");
	for (i = 0; i < 8; i++)
	{
		if ((tests_failed & 1) == 0)
		{
			writeStringToDisplay("p");
			if (report_to_stream == 1)
			{
				sendString(", pass");
			}
		}
		else
		{
			writeStringToDisplay("F");
			if (report_to_stream == 1)
			{
				sendString(", fail");
			}
		}
		tests_failed >>= 1;
	}
	if (report_to_stream != 0)
	{
		sendString("\r\n");
	}
}

/** Send real number in fixed-point representation to stream.
  * \param value The number to send.
  */
static void sendFix16(fix16_t value)
{
	uint8_t buffer[4];
	int j;

	writeU32LittleEndian(buffer, (uint32_t)value);
	for (j = 0; j < 4; j++)
	{
		streamPutOneByte(buffer[j]);
	}
}

/** Test statistical testing functions. The testing mode is set by the first
  * byte received from the stream.
  * - 'R': Send what hardwareRandom32Bytes() returns.
  * - 'S': Send moment-based statistical properties of HWRNG to stream.
  * - 'P': Send power-spectral density estimate of HWRNG to stream.
  * - 'B': Send bandwidth estimate off HWRNG to stream.
  * - 'A': Send results of autocorrelation computation to stream.
  * - 'E': Send maximum autocorrelation amplitude and entropy esimate to
  *        stream.
  * - Anything which is not an uppercase letter: grab input data from the
  *   stream, compute various statistical values and send them to the stream.
  *   The host can then check the output.
  */
void __attribute__ ((nomips16)) testStatistics(void)
{
	uint8_t mode;
	uint8_t buffer[4];
	uint8_t random_bytes[32];
	uint32_t start_count;
	uint32_t end_count;
	uint32_t cycles;
	uint32_t i;
	uint32_t sample;
	fix16_t mean;
	fix16_t variance;
	fix16_t kappa3; // non-standardised skewness
	fix16_t kappa4; // non-standardised kurtosis
	fix16_t entropy_estimate;

	mode = streamGetOneByte();
	if ((mode >= 'A') && (mode <= 'Z'))
	{
		if (mode == 'S')
		{
			report_to_stream = 1;
		}
		else if (mode == 'P')
		{
			report_to_stream = 2;
		}
		else if (mode == 'B')
		{
			report_to_stream = 3;
		}
		else if (mode == 'A')
		{
			report_to_stream = 4;
		}
		else if (mode == 'E')
		{
			report_to_stream = 5;
		}
		else
		{
			report_to_stream = 0;
		}
		while (true)
		{
			hardwareRandom32Bytes(random_bytes);
			if (!report_to_stream)
			{
				// Spam hardwareRandom32Bytes() output to stream,
				// so that host can inspect the raw HWRNG samples
				for (i = 0; i < sizeof(random_bytes); i++)
				{
					streamPutOneByte(random_bytes[i]);
				}
			}
		}
	} // end if ((mode >= 'A') && (mode <= 'Z'))
	else
	{
		while (true)
		{
			clearHistogram();
			for (i = 0; i < SAMPLE_COUNT; i++)
			{
				sample = streamGetOneByte();
				sample |= (streamGetOneByte() << 8);
				incrementHistogram(sample);
			}

			asm volatile("mfc0 %0, $9" : "=r"(start_count));

			mean = calculateCentralMoment(fix16_zero, 1);
			variance = calculateCentralMoment(mean, 2);
			kappa3 = calculateCentralMoment(mean, 3);
			kappa4 = calculateCentralMoment(mean, 4);
			entropy_estimate = estimateEntropy();

			asm volatile("mfc0 %0, $9" : "=r"(end_count)); // read as soon as possible
			cycles = (end_count - start_count) * 2; // Count ticks every 2 cycles

			sendFix16(mean);
			sendFix16(variance);
			sendFix16(kappa3);
			sendFix16(kappa4);
			sendFix16(entropy_estimate);
			// Tell host how long it took
			writeU32LittleEndian(buffer, cycles);
			for (i = 0; i < 4; i++)
			{
				streamPutOneByte(buffer[i]);
			}
		} // end while (true)
	} // end else clause of if ((mode >= 'A') && (mode <= 'Z'))
}

#endif // #ifdef TEST_STATISTICS
